In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.714057  1.144606  1.043462  1.032382
2013-01-02  0.145732 -1.105265 -1.060651 -1.428891
2013-01-03  0.432988  2.041437  2.089421  0.588848
2013-01-04  1.057972  0.440762  0.414154 -0.115355
2013-01-05  0.069159  1.555257 -0.586350 -0.959729
2013-01-06  0.920605  0.441707  1.826096  1.860218

In [5]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.714057  1.144606  1.043462  1.032382
2013-01-02  0.145732 -1.105265 -1.060651 -1.428891
2013-01-03  0.432988  2.041437  2.089421  0.588848

In [6]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
df.values

array([[-0.71405697,  1.14460561,  1.04346216,  1.03238184],
       [ 0.14573172, -1.10526541, -1.06065072, -1.42889075],
       [ 0.43298823,  2.04143728,  2.08942096,  0.58884842],
       [ 1.05797178,  0.44076216,  0.41415375, -0.11535469],
       [ 0.06915932,  1.55525695, -0.58634972, -0.95972897],
       [ 0.92060525,  0.44170688,  1.82609649,  1.86021835]])

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [10]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.318733  0.753084  0.621022  0.162912
std    0.645081  1.104951  1.274003  1.240148
min   -0.714057 -1.105265 -1.060651 -1.428891
25%    0.088302  0.440998 -0.336224 -0.748635
50%    0.289360  0.793156  0.728808  0.236747
75%    0.798701  1.452594  1.630438  0.921498
max    1.057972  2.041437  2.089421  1.860218

In [11]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-03  0.432988  2.041437  2.089421  0.588848
2013-01-05  0.069159  1.555257 -0.586350 -0.959729
2013-01-01 -0.714057  1.144606  1.043462  1.032382
2013-01-06  0.920605  0.441707  1.826096  1.860218
2013-01-04  1.057972  0.440762  0.414154 -0.115355
2013-01-02  0.145732 -1.105265 -1.060651 -1.428891

In [12]:
df['B']

2013-01-01    1.144606
2013-01-02   -1.105265
2013-01-03    2.041437
2013-01-04    0.440762
2013-01-05    1.555257
2013-01-06    0.441707
Freq: D, Name: B, dtype: float64

In [13]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.714057  1.144606  1.043462  1.032382
2013-01-02  0.145732 -1.105265 -1.060651 -1.428891
2013-01-03  0.432988  2.041437  2.089421  0.588848

In [14]:
df['20130102':'20130105']

                   A         B         C         D
2013-01-02  0.145732 -1.105265 -1.060651 -1.428891
2013-01-03  0.432988  2.041437  2.089421  0.588848
2013-01-04  1.057972  0.440762  0.414154 -0.115355
2013-01-05  0.069159  1.555257 -0.586350 -0.959729

In [15]:
df.loc[dates[0]]

A   -0.714057
B    1.144606
C    1.043462
D    1.032382
Name: 2013-01-01 00:00:00, dtype: float64

In [16]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.714057  1.144606
2013-01-02  0.145732 -1.105265
2013-01-03  0.432988  2.041437
2013-01-04  1.057972  0.440762
2013-01-05  0.069159  1.555257
2013-01-06  0.920605  0.441707

In [17]:
df.loc['20130101':'20130104',['A','B']]

                   A         B
2013-01-01 -0.714057  1.144606
2013-01-02  0.145732 -1.105265
2013-01-03  0.432988  2.041437
2013-01-04  1.057972  0.440762

In [18]:
df.loc['20130102',['A','B']]

A    0.145732
B   -1.105265
Name: 2013-01-02 00:00:00, dtype: float64

In [19]:
df.loc['20130102','A']

0.1457317194406516

In [20]:
df.iloc[3]

A    1.057972
B    0.440762
C    0.414154
D   -0.115355
Name: 2013-01-04 00:00:00, dtype: float64

In [21]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.057972  0.440762
2013-01-05  0.069159  1.555257

In [22]:
df.iloc[[0,2,4],[0,2]]

                   A         C
2013-01-01 -0.714057  1.043462
2013-01-03  0.432988  2.089421
2013-01-05  0.069159 -0.586350

In [23]:
df.iloc[[0,2,4],:]

                   A         B         C         D
2013-01-01 -0.714057  1.144606  1.043462  1.032382
2013-01-03  0.432988  2.041437  2.089421  0.588848
2013-01-05  0.069159  1.555257 -0.586350 -0.959729

In [24]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.144606  1.043462
2013-01-02 -1.105265 -1.060651
2013-01-03  2.041437  2.089421
2013-01-04  0.440762  0.414154
2013-01-05  1.555257 -0.586350
2013-01-06  0.441707  1.826096

In [25]:
df

                   A         B         C         D
2013-01-01 -0.714057  1.144606  1.043462  1.032382
2013-01-02  0.145732 -1.105265 -1.060651 -1.428891
2013-01-03  0.432988  2.041437  2.089421  0.588848
2013-01-04  1.057972  0.440762  0.414154 -0.115355
2013-01-05  0.069159  1.555257 -0.586350 -0.959729
2013-01-06  0.920605  0.441707  1.826096  1.860218

In [26]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.145732 -1.105265 -1.060651 -1.428891
2013-01-03  0.432988  2.041437  2.089421  0.588848
2013-01-04  1.057972  0.440762  0.414154 -0.115355
2013-01-05  0.069159  1.555257 -0.586350 -0.959729
2013-01-06  0.920605  0.441707  1.826096  1.860218

In [27]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.144606  1.043462  1.032382
2013-01-02  0.145732       NaN       NaN       NaN
2013-01-03  0.432988  2.041437  2.089421  0.588848
2013-01-04  1.057972  0.440762  0.414154       NaN
2013-01-05  0.069159  1.555257       NaN       NaN
2013-01-06  0.920605  0.441707  1.826096  1.860218

In [28]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01 -0.714057  1.144606  1.043462  1.032382
2013-01-02  0.145732 -1.105265 -1.060651 -1.428891
2013-01-03  0.432988  2.041437  2.089421  0.588848
2013-01-04  1.057972  0.440762  0.414154 -0.115355
2013-01-05  0.069159  1.555257 -0.586350 -0.959729
2013-01-06  0.920605  0.441707  1.826096  1.860218

In [29]:
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.714057  1.144606  1.043462  1.032382    one
2013-01-02  0.145732 -1.105265 -1.060651 -1.428891    one
2013-01-03  0.432988  2.041437  2.089421  0.588848    two
2013-01-04  1.057972  0.440762  0.414154 -0.115355  three
2013-01-05  0.069159  1.555257 -0.586350 -0.959729   four
2013-01-06  0.920605  0.441707  1.826096  1.860218  three

In [30]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [31]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.432988  2.041437  2.089421  0.588848   two
2013-01-05  0.069159  1.555257 -0.586350 -0.959729  four

In [32]:
df

                   A         B         C         D
2013-01-01 -0.714057  1.144606  1.043462  1.032382
2013-01-02  0.145732 -1.105265 -1.060651 -1.428891
2013-01-03  0.432988  2.041437  2.089421  0.588848
2013-01-04  1.057972  0.440762  0.414154 -0.115355
2013-01-05  0.069159  1.555257 -0.586350 -0.959729
2013-01-06  0.920605  0.441707  1.826096  1.860218

In [33]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.714057  1.144606  1.043462  1.032382
2013-01-02 -0.568325  0.039340 -0.017189 -0.396509
2013-01-03 -0.135337  2.080777  2.072232  0.192340
2013-01-04  0.922635  2.521540  2.486386  0.076985
2013-01-05  0.991794  4.076797  1.900036 -0.882744
2013-01-06  1.912399  4.518503  3.726133  0.977474

In [34]:
df.apply(lambda x: x.max() - x.min())

A    1.772029
B    3.146703
C    3.150072
D    3.289109
dtype: float64

In [41]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                    index=[0,1,2,3])
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7']},
                    index=[4,5,6,7])
df3 = pd.DataFrame({'A':['A8','A8','A10','A11'],
                    'B':['B8','B8','B10','B11'],
                    'C':['C8','C8','C10','C11'],
                    'D':['D8','D8','D10','D11']},
                    index=[8,9,10,11])

In [42]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [43]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [44]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A8   B8   C8   D8
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [46]:
result = pd.concat([df1, df2, df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A8   B8   C8   D8
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [48]:
result = pd.concat([df1, df2, df3], keys=['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A8   B8   C8   D8
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [49]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [53]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [54]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [57]:
df4 = pd.DataFrame({'B': ['B2','B3','B4','B5'],
                    'D': ['D2','D3','D4','D5'],
                    'F': ['F2','F3','F4','F5']},
                    index=[2,3,4,5])
result = pd.concat([df1, df4], axis=1)

In [58]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [59]:
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
4  B4  D4  F4
5  B5  D5  F5

In [61]:
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
4  NaN  NaN  NaN  NaN   B4   D4   F4
5  NaN  NaN  NaN  NaN   B5   D5   F5

In [62]:
result = pd.concat([df1,df4], axis=1, join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [64]:
result = pd.concat([df1,df4], axis=1, join_axes=[df1.index])
result

ipykernel_launcher:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [72]:
left = pd.DataFrame({'Key': ['K0','K4','K2','K3'],
                    'A': ['A0','A1','A2','A3'],
                    'B': ['B0','B1','B2','B3']})
right = pd.DataFrame({'Key': ['K0','K1','K2','K3'],
                      'C': ['C0','C1','C2','C3'],
                      'D': ['D0','D1','D2','D3']})

In [73]:
left

    A   B Key
0  A0  B0  K0
1  A1  B1  K4
2  A2  B2  K2
3  A3  B3  K3

In [74]:
right

    C   D Key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [75]:
pd.merge(left, right, on='Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A2  B2  K2  C2  D2
2  A3  B3  K3  C3  D3

In [76]:
pd.merge(left, right, how='left', on='Key')

    A   B Key    C    D
0  A0  B0  K0   C0   D0
1  A1  B1  K4  NaN  NaN
2  A2  B2  K2   C2   D2
3  A3  B3  K3   C3   D3

In [77]:
pd.merge(left, right, how='right', on='Key')

     A    B Key   C   D
0   A0   B0  K0  C0  D0
1   A2   B2  K2  C2  D2
2   A3   B3  K3  C3  D3
3  NaN  NaN  K1  C1  D1

In [78]:
pd.merge(left, right, how='inner', on='Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A2  B2  K2  C2  D2
2  A3  B3  K3  C3  D3

In [79]:
pd.merge(left, right, how='outer', on='Key')

     A    B Key    C    D
0   A0   B0  K0   C0   D0
1   A1   B1  K4  NaN  NaN
2   A2   B2  K2   C2   D2
3   A3   B3  K3   C3   D3
4  NaN  NaN  K1   C1   D1